MikroElektronika/core_packages/PIC/XC8/def/PIC18F56K42/mcu.h
// Register: CCDPF
#define CCDPF CCDPF
extern volatile unsigned char           CCDPF               __at(0x3A98);
#ifndef _LIB_BUILD
asm("CCDPF equ 03A98h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPF0                 :1;
        unsigned CCDPF1                 :1;
        unsigned CCDPF2                 :1;
        unsigned CCDPF3                 :1;
        unsigned CCDPF4                 :1;
        unsigned CCDPF5                 :1;
        unsigned CCDPF6                 :1;
        unsigned CCDPF7                 :1;
    };
} CCDPFbits_t;
extern volatile CCDPFbits_t CCDPFbits __at(0x3A98);
// bitfield macros
#define _CCDPF_CCDPF0_POSN                                  0x0
#define _CCDPF_CCDPF0_POSITION                              0x0
#define _CCDPF_CCDPF0_SIZE                                  0x1
#define _CCDPF_CCDPF0_LENGTH                                0x1
#define _CCDPF_CCDPF0_MASK                                  0x1
#define _CCDPF_CCDPF1_POSN                                  0x1
#define _CCDPF_CCDPF1_POSITION                              0x1
#define _CCDPF_CCDPF1_SIZE                                  0x1
#define _CCDPF_CCDPF1_LENGTH                                0x1
#define _CCDPF_CCDPF1_MASK                                  0x2
#define _CCDPF_CCDPF2_POSN                                  0x2
#define _CCDPF_CCDPF2_POSITION                              0x2
#define _CCDPF_CCDPF2_SIZE                                  0x1
#define _CCDPF_CCDPF2_LENGTH                                0x1
#define _CCDPF_CCDPF2_MASK                                  0x4
#define _CCDPF_CCDPF3_POSN                                  0x3
#define _CCDPF_CCDPF3_POSITION                              0x3
#define _CCDPF_CCDPF3_SIZE                                  0x1
#define _CCDPF_CCDPF3_LENGTH                                0x1
#define _CCDPF_CCDPF3_MASK                                  0x8
#define _CCDPF_CCDPF4_POSN                                  0x4
#define _CCDPF_CCDPF4_POSITION                              0x4
#define _CCDPF_CCDPF4_SIZE                                  0x1
#define _CCDPF_CCDPF4_LENGTH                                0x1
#define _CCDPF_CCDPF4_MASK                                  0x10
#define _CCDPF_CCDPF5_POSN                                  0x5
#define _CCDPF_CCDPF5_POSITION                              0x5
#define _CCDPF_CCDPF5_SIZE                                  0x1
#define _CCDPF_CCDPF5_LENGTH                                0x1
#define _CCDPF_CCDPF5_MASK                                  0x20
#define _CCDPF_CCDPF6_POSN                                  0x6
#define _CCDPF_CCDPF6_POSITION                              0x6
#define _CCDPF_CCDPF6_SIZE                                  0x1
#define _CCDPF_CCDPF6_LENGTH                                0x1
#define _CCDPF_CCDPF6_MASK                                  0x40
#define _CCDPF_CCDPF7_POSN                                  0x7
#define _CCDPF_CCDPF7_POSITION                              0x7
#define _CCDPF_CCDPF7_SIZE                                  0x1
#define _CCDPF_CCDPF7_LENGTH                                0x1
#define _CCDPF_CCDPF7_MASK                                  0x80

// Register: CCDNF
#define CCDNF CCDNF
extern volatile unsigned char           CCDNF               __at(0x3A99);
#ifndef _LIB_BUILD
asm("CCDNF equ 03A99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNF0                 :1;
        unsigned CCDNF1                 :1;
        unsigned CCDNF2                 :1;
        unsigned CCDNF3                 :1;
        unsigned CCDNF4                 :1;
        unsigned CCDNF5                 :1;
        unsigned CCDNF6                 :1;
        unsigned CCDNF7                 :1;
    };
} CCDNFbits_t;
extern volatile CCDNFbits_t CCDNFbits __at(0x3A99);
// bitfield macros
#define _CCDNF_CCDNF0_POSN                                  0x0
#define _CCDNF_CCDNF0_POSITION                              0x0
#define _CCDNF_CCDNF0_SIZE                                  0x1
#define _CCDNF_CCDNF0_LENGTH                                0x1
#define _CCDNF_CCDNF0_MASK                                  0x1
#define _CCDNF_CCDNF1_POSN                                  0x1
#define _CCDNF_CCDNF1_POSITION                              0x1
#define _CCDNF_CCDNF1_SIZE                                  0x1
#define _CCDNF_CCDNF1_LENGTH                                0x1
#define _CCDNF_CCDNF1_MASK                                  0x2
#define _CCDNF_CCDNF2_POSN                                  0x2
#define _CCDNF_CCDNF2_POSITION                              0x2
#define _CCDNF_CCDNF2_SIZE                                  0x1
#define _CCDNF_CCDNF2_LENGTH                                0x1
#define _CCDNF_CCDNF2_MASK                                  0x4
#define _CCDNF_CCDNF3_POSN                                  0x3
#define _CCDNF_CCDNF3_POSITION                              0x3
#define _CCDNF_CCDNF3_SIZE                                  0x1
#define _CCDNF_CCDNF3_LENGTH                                0x1
#define _CCDNF_CCDNF3_MASK                                  0x8
#define _CCDNF_CCDNF4_POSN                                  0x4
#define _CCDNF_CCDNF4_POSITION                              0x4
#define _CCDNF_CCDNF4_SIZE                                  0x1
#define _CCDNF_CCDNF4_LENGTH                                0x1
#define _CCDNF_CCDNF4_MASK                                  0x10
#define _CCDNF_CCDNF5_POSN                                  0x5
#define _CCDNF_CCDNF5_POSITION                              0x5
#define _CCDNF_CCDNF5_SIZE                                  0x1
#define _CCDNF_CCDNF5_LENGTH                                0x1
#define _CCDNF_CCDNF5_MASK                                  0x20
#define _CCDNF_CCDNF6_POSN                                  0x6
#define _CCDNF_CCDNF6_POSITION                              0x6
#define _CCDNF_CCDNF6_SIZE                                  0x1
#define _CCDNF_CCDNF6_LENGTH                                0x1
#define _CCDNF_CCDNF6_MASK                                  0x40
#define _CCDNF_CCDNF7_POSN                                  0x7
#define _CCDNF_CCDNF7_POSITION                              0x7
#define _CCDNF_CCDNF7_SIZE                                  0x1
#define _CCDNF_CCDNF7_LENGTH                                0x1
#define _CCDNF_CCDNF7_MASK                                  0x80

// Register: CCDCON
#define CCDCON CCDCON
extern volatile unsigned char           CCDCON              __at(0x3ABE);
#ifndef _LIB_BUILD
asm("CCDCON equ 03ABEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DS                     :2;
        unsigned                        :5;
        unsigned EN                     :1;
    };
    struct {
        unsigned CCDS                   :2;
        unsigned                        :5;
        unsigned CCDEN                  :1;
    };
    struct {
        unsigned SEL0                   :1;
        unsigned SEL1                   :1;
    };
} CCDCONbits_t;
extern volatile CCDCONbits_t CCDCONbits __at(0x3ABE);
// bitfield macros
#define _CCDCON_DS_POSN                                     0x0
#define _CCDCON_DS_POSITION                                 0x0
#define _CCDCON_DS_SIZE                                     0x2
#define _CCDCON_DS_LENGTH                                   0x2
#define _CCDCON_DS_MASK                                     0x3
#define _CCDCON_EN_POSN                                     0x7
#define _CCDCON_EN_POSITION                                 0x7
#define _CCDCON_EN_SIZE                                     0x1
#define _CCDCON_EN_LENGTH                                   0x1
#define _CCDCON_EN_MASK                                     0x80
#define _CCDCON_CCDS_POSN                                   0x0
#define _CCDCON_CCDS_POSITION                               0x0
#define _CCDCON_CCDS_SIZE                                   0x2
#define _CCDCON_CCDS_LENGTH                                 0x2
#define _CCDCON_CCDS_MASK                                   0x3
#define _CCDCON_CCDEN_POSN                                  0x7
#define _CCDCON_CCDEN_POSITION                              0x7
#define _CCDCON_CCDEN_SIZE                                  0x1
#define _CCDCON_CCDEN_LENGTH                                0x1
#define _CCDCON_CCDEN_MASK                                  0x80
#define _CCDCON_SEL0_POSN                                   0x0
#define _CCDCON_SEL0_POSITION                               0x0
#define _CCDCON_SEL0_SIZE                                   0x1
#define _CCDCON_SEL0_LENGTH                                 0x1
#define _CCDCON_SEL0_MASK                                   0x1
#define _CCDCON_SEL1_POSN                                   0x1
#define _CCDCON_SEL1_POSITION                               0x1
#define _CCDCON_SEL1_SIZE                                   0x1
#define _CCDCON_SEL1_LENGTH                                 0x1
#define _CCDCON_SEL1_MASK                                   0x2

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0x3ABF);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 03ABFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0x3ABF);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

