MikroElektronika/core_packages/PIC/XC8/def/PIC18F56K42/mcu.h
extern volatile TMR5GCONbits_t TMR5GCONbits __at(0x3F9B);
// bitfield macros
#define _TMR5GCON_GVAL_POSN                                 0x2
#define _TMR5GCON_GVAL_POSITION                             0x2
#define _TMR5GCON_GVAL_SIZE                                 0x1
#define _TMR5GCON_GVAL_LENGTH                               0x1
#define _TMR5GCON_GVAL_MASK                                 0x4
#define _TMR5GCON_GGO_POSN                                  0x3
#define _TMR5GCON_GGO_POSITION                              0x3
#define _TMR5GCON_GGO_SIZE                                  0x1
#define _TMR5GCON_GGO_LENGTH                                0x1
#define _TMR5GCON_GGO_MASK                                  0x8
#define _TMR5GCON_GSPM_POSN                                 0x4
#define _TMR5GCON_GSPM_POSITION                             0x4
#define _TMR5GCON_GSPM_SIZE                                 0x1
#define _TMR5GCON_GSPM_LENGTH                               0x1
#define _TMR5GCON_GSPM_MASK                                 0x10
#define _TMR5GCON_GTM_POSN                                  0x5
#define _TMR5GCON_GTM_POSITION                              0x5
#define _TMR5GCON_GTM_SIZE                                  0x1
#define _TMR5GCON_GTM_LENGTH                                0x1
#define _TMR5GCON_GTM_MASK                                  0x20
#define _TMR5GCON_GPOL_POSN                                 0x6
#define _TMR5GCON_GPOL_POSITION                             0x6
#define _TMR5GCON_GPOL_SIZE                                 0x1
#define _TMR5GCON_GPOL_LENGTH                               0x1
#define _TMR5GCON_GPOL_MASK                                 0x40
#define _TMR5GCON_GE_POSN                                   0x7
#define _TMR5GCON_GE_POSITION                               0x7
#define _TMR5GCON_GE_SIZE                                   0x1
#define _TMR5GCON_GE_LENGTH                                 0x1
#define _TMR5GCON_GE_MASK                                   0x80
#define _TMR5GCON_T5GVAL_POSN                               0x2
#define _TMR5GCON_T5GVAL_POSITION                           0x2
#define _TMR5GCON_T5GVAL_SIZE                               0x1
#define _TMR5GCON_T5GVAL_LENGTH                             0x1
#define _TMR5GCON_T5GVAL_MASK                               0x4
#define _TMR5GCON_T5GGO_POSN                                0x3
#define _TMR5GCON_T5GGO_POSITION                            0x3
#define _TMR5GCON_T5GGO_SIZE                                0x1
#define _TMR5GCON_T5GGO_LENGTH                              0x1
#define _TMR5GCON_T5GGO_MASK                                0x8
#define _TMR5GCON_T5GSPM_POSN                               0x4
#define _TMR5GCON_T5GSPM_POSITION                           0x4
#define _TMR5GCON_T5GSPM_SIZE                               0x1
#define _TMR5GCON_T5GSPM_LENGTH                             0x1
#define _TMR5GCON_T5GSPM_MASK                               0x10
#define _TMR5GCON_T5GTM_POSN                                0x5
#define _TMR5GCON_T5GTM_POSITION                            0x5
#define _TMR5GCON_T5GTM_SIZE                                0x1
#define _TMR5GCON_T5GTM_LENGTH                              0x1
#define _TMR5GCON_T5GTM_MASK                                0x20
#define _TMR5GCON_T5GPOL_POSN                               0x6
#define _TMR5GCON_T5GPOL_POSITION                           0x6
#define _TMR5GCON_T5GPOL_SIZE                               0x1
#define _TMR5GCON_T5GPOL_LENGTH                             0x1
#define _TMR5GCON_T5GPOL_MASK                               0x40
#define _TMR5GCON_T5GE_POSN                                 0x7
#define _TMR5GCON_T5GE_POSITION                             0x7
#define _TMR5GCON_T5GE_SIZE                                 0x1
#define _TMR5GCON_T5GE_LENGTH                               0x1
#define _TMR5GCON_T5GE_MASK                                 0x80
#define _TMR5GCON_NOT_DONE_POSN                             0x3
#define _TMR5GCON_NOT_DONE_POSITION                         0x3
#define _TMR5GCON_NOT_DONE_SIZE                             0x1
#define _TMR5GCON_NOT_DONE_LENGTH                           0x1
#define _TMR5GCON_NOT_DONE_MASK                             0x8
#define _TMR5GCON_NOT_T5DONE_POSN                           0x3
#define _TMR5GCON_NOT_T5DONE_POSITION                       0x3
#define _TMR5GCON_NOT_T5DONE_SIZE                           0x1
#define _TMR5GCON_NOT_T5DONE_LENGTH                         0x1
#define _TMR5GCON_NOT_T5DONE_MASK                           0x8
#define _TMR5GCON_GGO_NOT_DONE_POSN                         0x3
#define _TMR5GCON_GGO_NOT_DONE_POSITION                     0x3
#define _TMR5GCON_GGO_NOT_DONE_SIZE                         0x1
#define _TMR5GCON_GGO_NOT_DONE_LENGTH                       0x1
#define _TMR5GCON_GGO_NOT_DONE_MASK                         0x8
#define _TMR5GCON_GGO_nDONE_POSN                            0x3
#define _TMR5GCON_GGO_nDONE_POSITION                        0x3
#define _TMR5GCON_GGO_nDONE_SIZE                            0x1
#define _TMR5GCON_GGO_nDONE_LENGTH                          0x1
#define _TMR5GCON_GGO_nDONE_MASK                            0x8
#define _TMR5GCON_T5GGO_NOT_DONE_POSN                       0x3
#define _TMR5GCON_T5GGO_NOT_DONE_POSITION                   0x3
#define _TMR5GCON_T5GGO_NOT_DONE_SIZE                       0x1
#define _TMR5GCON_T5GGO_NOT_DONE_LENGTH                     0x1
#define _TMR5GCON_T5GGO_NOT_DONE_MASK                       0x8
#define _TMR5GCON_T5GGO_nDONE_POSN                          0x3
#define _TMR5GCON_T5GGO_nDONE_POSITION                      0x3
#define _TMR5GCON_T5GGO_nDONE_SIZE                          0x1
#define _TMR5GCON_T5GGO_nDONE_LENGTH                        0x1
#define _TMR5GCON_T5GGO_nDONE_MASK                          0x8

// Register: T5GATE
#define T5GATE T5GATE
extern volatile unsigned char           T5GATE              __at(0x3F9C);
#ifndef _LIB_BUILD
asm("T5GATE equ 03F9Ch");
#endif
// aliases
extern volatile unsigned char           TMR5GATE            __at(0x3F9C);
#ifndef _LIB_BUILD
asm("TMR5GATE equ 03F9Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :8;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T5GSS0                 :1;
        unsigned T5GSS1                 :1;
        unsigned T5GSS2                 :1;
        unsigned T5GSS3                 :1;
        unsigned T5GSS4                 :1;
    };
} T5GATEbits_t;
extern volatile T5GATEbits_t T5GATEbits __at(0x3F9C);
// bitfield macros
#define _T5GATE_GSS_POSN                                    0x0
#define _T5GATE_GSS_POSITION                                0x0
#define _T5GATE_GSS_SIZE                                    0x8
#define _T5GATE_GSS_LENGTH                                  0x8
#define _T5GATE_GSS_MASK                                    0xFF
#define _T5GATE_GSS0_POSN                                   0x0
#define _T5GATE_GSS0_POSITION                               0x0
#define _T5GATE_GSS0_SIZE                                   0x1
#define _T5GATE_GSS0_LENGTH                                 0x1
#define _T5GATE_GSS0_MASK                                   0x1
#define _T5GATE_GSS1_POSN                                   0x1
#define _T5GATE_GSS1_POSITION                               0x1
#define _T5GATE_GSS1_SIZE                                   0x1
#define _T5GATE_GSS1_LENGTH                                 0x1
#define _T5GATE_GSS1_MASK                                   0x2
#define _T5GATE_GSS2_POSN                                   0x2
#define _T5GATE_GSS2_POSITION                               0x2
#define _T5GATE_GSS2_SIZE                                   0x1
#define _T5GATE_GSS2_LENGTH                                 0x1
#define _T5GATE_GSS2_MASK                                   0x4
#define _T5GATE_GSS3_POSN                                   0x3
#define _T5GATE_GSS3_POSITION                               0x3
#define _T5GATE_GSS3_SIZE                                   0x1
#define _T5GATE_GSS3_LENGTH                                 0x1
#define _T5GATE_GSS3_MASK                                   0x8
#define _T5GATE_GSS4_POSN                                   0x4
#define _T5GATE_GSS4_POSITION                               0x4
#define _T5GATE_GSS4_SIZE                                   0x1
#define _T5GATE_GSS4_LENGTH                                 0x1
#define _T5GATE_GSS4_MASK                                   0x10
#define _T5GATE_T5GSS0_POSN                                 0x0
#define _T5GATE_T5GSS0_POSITION                             0x0
#define _T5GATE_T5GSS0_SIZE                                 0x1
#define _T5GATE_T5GSS0_LENGTH                               0x1
#define _T5GATE_T5GSS0_MASK                                 0x1
#define _T5GATE_T5GSS1_POSN                                 0x1
#define _T5GATE_T5GSS1_POSITION                             0x1
#define _T5GATE_T5GSS1_SIZE                                 0x1
#define _T5GATE_T5GSS1_LENGTH                               0x1
#define _T5GATE_T5GSS1_MASK                                 0x2
#define _T5GATE_T5GSS2_POSN                                 0x2
#define _T5GATE_T5GSS2_POSITION                             0x2
#define _T5GATE_T5GSS2_SIZE                                 0x1
#define _T5GATE_T5GSS2_LENGTH                               0x1
#define _T5GATE_T5GSS2_MASK                                 0x4
#define _T5GATE_T5GSS3_POSN                                 0x3
#define _T5GATE_T5GSS3_POSITION                             0x3
#define _T5GATE_T5GSS3_SIZE                                 0x1
#define _T5GATE_T5GSS3_LENGTH                               0x1
#define _T5GATE_T5GSS3_MASK                                 0x8
#define _T5GATE_T5GSS4_POSN                                 0x4
#define _T5GATE_T5GSS4_POSITION                             0x4
#define _T5GATE_T5GSS4_SIZE                                 0x1
#define _T5GATE_T5GSS4_LENGTH                               0x1
#define _T5GATE_T5GSS4_MASK                                 0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :8;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T5GSS0                 :1;
        unsigned T5GSS1                 :1;
        unsigned T5GSS2                 :1;
        unsigned T5GSS3                 :1;
        unsigned T5GSS4                 :1;
    };
} TMR5GATEbits_t;
extern volatile TMR5GATEbits_t TMR5GATEbits __at(0x3F9C);
// bitfield macros
#define _TMR5GATE_GSS_POSN                                  0x0
#define _TMR5GATE_GSS_POSITION                              0x0
#define _TMR5GATE_GSS_SIZE                                  0x8
#define _TMR5GATE_GSS_LENGTH                                0x8
#define _TMR5GATE_GSS_MASK                                  0xFF
#define _TMR5GATE_GSS0_POSN                                 0x0
#define _TMR5GATE_GSS0_POSITION                             0x0
#define _TMR5GATE_GSS0_SIZE                                 0x1
#define _TMR5GATE_GSS0_LENGTH                               0x1
#define _TMR5GATE_GSS0_MASK                                 0x1
#define _TMR5GATE_GSS1_POSN                                 0x1
#define _TMR5GATE_GSS1_POSITION                             0x1
#define _TMR5GATE_GSS1_SIZE                                 0x1
#define _TMR5GATE_GSS1_LENGTH                               0x1
#define _TMR5GATE_GSS1_MASK                                 0x2
#define _TMR5GATE_GSS2_POSN                                 0x2
#define _TMR5GATE_GSS2_POSITION                             0x2
#define _TMR5GATE_GSS2_SIZE                                 0x1
#define _TMR5GATE_GSS2_LENGTH                               0x1
#define _TMR5GATE_GSS2_MASK                                 0x4
#define _TMR5GATE_GSS3_POSN                                 0x3
#define _TMR5GATE_GSS3_POSITION                             0x3
#define _TMR5GATE_GSS3_SIZE                                 0x1
#define _TMR5GATE_GSS3_LENGTH                               0x1
#define _TMR5GATE_GSS3_MASK                                 0x8
#define _TMR5GATE_GSS4_POSN                                 0x4
#define _TMR5GATE_GSS4_POSITION                             0x4
#define _TMR5GATE_GSS4_SIZE                                 0x1
#define _TMR5GATE_GSS4_LENGTH                               0x1
#define _TMR5GATE_GSS4_MASK                                 0x10
#define _TMR5GATE_T5GSS0_POSN                               0x0
#define _TMR5GATE_T5GSS0_POSITION                           0x0
#define _TMR5GATE_T5GSS0_SIZE                               0x1
#define _TMR5GATE_T5GSS0_LENGTH                             0x1
#define _TMR5GATE_T5GSS0_MASK                               0x1
#define _TMR5GATE_T5GSS1_POSN                               0x1
#define _TMR5GATE_T5GSS1_POSITION                           0x1
#define _TMR5GATE_T5GSS1_SIZE                               0x1
#define _TMR5GATE_T5GSS1_LENGTH                             0x1
#define _TMR5GATE_T5GSS1_MASK                               0x2
#define _TMR5GATE_T5GSS2_POSN                               0x2
#define _TMR5GATE_T5GSS2_POSITION                           0x2
#define _TMR5GATE_T5GSS2_SIZE                               0x1
#define _TMR5GATE_T5GSS2_LENGTH                             0x1
#define _TMR5GATE_T5GSS2_MASK                               0x4
#define _TMR5GATE_T5GSS3_POSN                               0x3
#define _TMR5GATE_T5GSS3_POSITION                           0x3
#define _TMR5GATE_T5GSS3_SIZE                               0x1
#define _TMR5GATE_T5GSS3_LENGTH                             0x1
#define _TMR5GATE_T5GSS3_MASK                               0x8
#define _TMR5GATE_T5GSS4_POSN                               0x4
#define _TMR5GATE_T5GSS4_POSITION                           0x4
#define _TMR5GATE_T5GSS4_SIZE                               0x1
#define _TMR5GATE_T5GSS4_LENGTH                             0x1
#define _TMR5GATE_T5GSS4_MASK                               0x10

// Register: T5CLK
#define T5CLK T5CLK
extern volatile unsigned char           T5CLK               __at(0x3F9D);
#ifndef _LIB_BUILD
asm("T5CLK equ 03F9Dh");
#endif
// aliases
extern volatile unsigned char           TMR5CLK             __at(0x3F9D);
#ifndef _LIB_BUILD
asm("TMR5CLK equ 03F9Dh");
#endif
extern volatile unsigned char           _PR5                 __at(0x3F9D);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PR5 equ 03F9Dh");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T5CS0                  :1;
        unsigned T5CS1                  :1;
        unsigned T5CS2                  :1;
        unsigned T5CS3                  :1;
        unsigned T5CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} T5CLKbits_t;
extern volatile T5CLKbits_t T5CLKbits __at(0x3F9D);
// bitfield macros
#define _T5CLK_CS_POSN                                      0x0
#define _T5CLK_CS_POSITION                                  0x0
#define _T5CLK_CS_SIZE                                      0x8
#define _T5CLK_CS_LENGTH                                    0x8
#define _T5CLK_CS_MASK                                      0xFF
#define _T5CLK_T5CS0_POSN                                   0x0
#define _T5CLK_T5CS0_POSITION                               0x0
#define _T5CLK_T5CS0_SIZE                                   0x1
#define _T5CLK_T5CS0_LENGTH                                 0x1
#define _T5CLK_T5CS0_MASK                                   0x1
#define _T5CLK_T5CS1_POSN                                   0x1
#define _T5CLK_T5CS1_POSITION                               0x1
#define _T5CLK_T5CS1_SIZE                                   0x1
#define _T5CLK_T5CS1_LENGTH                                 0x1
#define _T5CLK_T5CS1_MASK                                   0x2
#define _T5CLK_T5CS2_POSN                                   0x2
#define _T5CLK_T5CS2_POSITION                               0x2
#define _T5CLK_T5CS2_SIZE                                   0x1
#define _T5CLK_T5CS2_LENGTH                                 0x1
#define _T5CLK_T5CS2_MASK                                   0x4
#define _T5CLK_T5CS3_POSN                                   0x3
#define _T5CLK_T5CS3_POSITION                               0x3
#define _T5CLK_T5CS3_SIZE                                   0x1
#define _T5CLK_T5CS3_LENGTH                                 0x1
#define _T5CLK_T5CS3_MASK                                   0x8
#define _T5CLK_T5CS4_POSN                                   0x4
#define _T5CLK_T5CS4_POSITION                               0x4
#define _T5CLK_T5CS4_SIZE                                   0x1
#define _T5CLK_T5CS4_LENGTH                                 0x1
#define _T5CLK_T5CS4_MASK                                   0x10
#define _T5CLK_CS0_POSN                                     0x0
#define _T5CLK_CS0_POSITION                                 0x0
#define _T5CLK_CS0_SIZE                                     0x1
#define _T5CLK_CS0_LENGTH                                   0x1
#define _T5CLK_CS0_MASK                                     0x1
#define _T5CLK_CS1_POSN                                     0x1
#define _T5CLK_CS1_POSITION                                 0x1
#define _T5CLK_CS1_SIZE                                     0x1
#define _T5CLK_CS1_LENGTH                                   0x1
#define _T5CLK_CS1_MASK                                     0x2
#define _T5CLK_CS2_POSN                                     0x2
#define _T5CLK_CS2_POSITION                                 0x2
#define _T5CLK_CS2_SIZE                                     0x1
#define _T5CLK_CS2_LENGTH                                   0x1
#define _T5CLK_CS2_MASK                                     0x4
#define _T5CLK_CS3_POSN                                     0x3
#define _T5CLK_CS3_POSITION                                 0x3
#define _T5CLK_CS3_SIZE                                     0x1
#define _T5CLK_CS3_LENGTH                                   0x1
#define _T5CLK_CS3_MASK                                     0x8
#define _T5CLK_CS4_POSN                                     0x4
#define _T5CLK_CS4_POSITION                                 0x4
#define _T5CLK_CS4_SIZE                                     0x1
#define _T5CLK_CS4_LENGTH                                   0x1
#define _T5CLK_CS4_MASK                                     0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T5CS0                  :1;
        unsigned T5CS1                  :1;
        unsigned T5CS2                  :1;
        unsigned T5CS3                  :1;
        unsigned T5CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} TMR5CLKbits_t;
