MikroElektronika/core_packages/PIC/XC8/def/PIC18F56K42/mcu.h
extern volatile __bit                   TMR110              __at(0x1FD8A);	// @ (0x3FB1 * 8 + 2)
#define                                 TMR110_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR111>
extern volatile __bit                   TMR111              __at(0x1FD8B);	// @ (0x3FB1 * 8 + 3)
#define                                 TMR111_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR112>
extern volatile __bit                   TMR112              __at(0x1FD8C);	// @ (0x3FB1 * 8 + 4)
#define                                 TMR112_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR113>
extern volatile __bit                   TMR113              __at(0x1FD8D);	// @ (0x3FB1 * 8 + 5)
#define                                 TMR113_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR114>
extern volatile __bit                   TMR114              __at(0x1FD8E);	// @ (0x3FB1 * 8 + 6)
#define                                 TMR114_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR115>
extern volatile __bit                   TMR115              __at(0x1FD8F);	// @ (0x3FB1 * 8 + 7)
#define                                 TMR115_bit          _BIT_ACCESS(TMR1H,7)
// PIE4<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x1CCA1);	// @ (0x3994 * 8 + 1)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE4,1)
// PIR4<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x1CD21);	// @ (0x39A4 * 8 + 1)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR4,1)
// IPR4<TMR1GIP>
extern volatile __bit                   TMR1GIP             __at(0x1CC21);	// @ (0x3984 * 8 + 1)
#define                                 TMR1GIP_bit         _BIT_ACCESS(IPR4,1)
// TMR1H<TMR1H0>
extern volatile __bit                   TMR1H0              __at(0x1FD88);	// @ (0x3FB1 * 8 + 0)
#define                                 TMR1H0_bit          _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR1H1>
extern volatile __bit                   TMR1H1              __at(0x1FD89);	// @ (0x3FB1 * 8 + 1)
#define                                 TMR1H1_bit          _BIT_ACCESS(TMR1H,1)
// TMR1H<TMR1H2>
extern volatile __bit                   TMR1H2              __at(0x1FD8A);	// @ (0x3FB1 * 8 + 2)
#define                                 TMR1H2_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR1H3>
extern volatile __bit                   TMR1H3              __at(0x1FD8B);	// @ (0x3FB1 * 8 + 3)
#define                                 TMR1H3_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR1H4>
extern volatile __bit                   TMR1H4              __at(0x1FD8C);	// @ (0x3FB1 * 8 + 4)
#define                                 TMR1H4_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR1H5>
extern volatile __bit                   TMR1H5              __at(0x1FD8D);	// @ (0x3FB1 * 8 + 5)
#define                                 TMR1H5_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR1H6>
extern volatile __bit                   TMR1H6              __at(0x1FD8E);	// @ (0x3FB1 * 8 + 6)
#define                                 TMR1H6_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR1H7>
extern volatile __bit                   TMR1H7              __at(0x1FD8F);	// @ (0x3FB1 * 8 + 7)
#define                                 TMR1H7_bit          _BIT_ACCESS(TMR1H,7)
// PIE4<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x1CCA0);	// @ (0x3994 * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x1CD20);	// @ (0x39A4 * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<TMR1IP>
extern volatile __bit                   TMR1IP              __at(0x1CC20);	// @ (0x3984 * 8 + 0)
#define                                 TMR1IP_bit          _BIT_ACCESS(IPR4,0)
// TMR1L<TMR1L0>
extern volatile __bit                   TMR1L0              __at(0x1FD80);	// @ (0x3FB0 * 8 + 0)
#define                                 TMR1L0_bit          _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR1L1>
extern volatile __bit                   TMR1L1              __at(0x1FD81);	// @ (0x3FB0 * 8 + 1)
#define                                 TMR1L1_bit          _BIT_ACCESS(TMR1L,1)
// TMR1L<TMR1L2>
extern volatile __bit                   TMR1L2              __at(0x1FD82);	// @ (0x3FB0 * 8 + 2)
#define                                 TMR1L2_bit          _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR1L3>
extern volatile __bit                   TMR1L3              __at(0x1FD83);	// @ (0x3FB0 * 8 + 3)
#define                                 TMR1L3_bit          _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR1L4>
extern volatile __bit                   TMR1L4              __at(0x1FD84);	// @ (0x3FB0 * 8 + 4)
#define                                 TMR1L4_bit          _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR1L5>
extern volatile __bit                   TMR1L5              __at(0x1FD85);	// @ (0x3FB0 * 8 + 5)
#define                                 TMR1L5_bit          _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR1L6>
extern volatile __bit                   TMR1L6              __at(0x1FD86);	// @ (0x3FB0 * 8 + 6)
#define                                 TMR1L6_bit          _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR1L7>
extern volatile __bit                   TMR1L7              __at(0x1FD87);	// @ (0x3FB0 * 8 + 7)
#define                                 TMR1L7_bit          _BIT_ACCESS(TMR1L,7)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x1CE09);	// @ (0x39C1 * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x1FD90);	// @ (0x3FB2 * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// SMT1TMRU<TMR20>
extern volatile __bit                   TMR20               __at(0x1F8A4);	// @ (0x3F14 * 8 + 4)
#define                                 TMR20_bit           _BIT_ACCESS(SMT1TMRU,4)
// SMT1TMRU<TMR21>
extern volatile __bit                   TMR21               __at(0x1F8A5);	// @ (0x3F14 * 8 + 5)
#define                                 TMR21_bit           _BIT_ACCESS(SMT1TMRU,5)
// SMT1TMRU<TMR22>
extern volatile __bit                   TMR22               __at(0x1F8A6);	// @ (0x3F14 * 8 + 6)
#define                                 TMR22_bit           _BIT_ACCESS(SMT1TMRU,6)
// SMT1TMRU<TMR23>
extern volatile __bit                   TMR23               __at(0x1F8A7);	// @ (0x3F14 * 8 + 7)
#define                                 TMR23_bit           _BIT_ACCESS(SMT1TMRU,7)
// PIE4<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x1CCA2);	// @ (0x3994 * 8 + 2)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x1CD22);	// @ (0x39A4 * 8 + 2)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR4,2)
// IPR4<TMR2IP>
extern volatile __bit                   TMR2IP              __at(0x1CC22);	// @ (0x3984 * 8 + 2)
#define                                 TMR2IP_bit          _BIT_ACCESS(IPR4,2)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x1CE0A);	// @ (0x39C1 * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x1FD67);	// @ (0x3FAC * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// TMR3L<TMR30>
extern volatile __bit                   TMR30               __at(0x1FD20);	// @ (0x3FA4 * 8 + 0)
#define                                 TMR30_bit           _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR31>
extern volatile __bit                   TMR31               __at(0x1FD21);	// @ (0x3FA4 * 8 + 1)
#define                                 TMR31_bit           _BIT_ACCESS(TMR3L,1)
// TMR3H<TMR310>
extern volatile __bit                   TMR310              __at(0x1FD2A);	// @ (0x3FA5 * 8 + 2)
#define                                 TMR310_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR311>
extern volatile __bit                   TMR311              __at(0x1FD2B);	// @ (0x3FA5 * 8 + 3)
#define                                 TMR311_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR312>
extern volatile __bit                   TMR312              __at(0x1FD2C);	// @ (0x3FA5 * 8 + 4)
#define                                 TMR312_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR313>
extern volatile __bit                   TMR313              __at(0x1FD2D);	// @ (0x3FA5 * 8 + 5)
#define                                 TMR313_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR314>
extern volatile __bit                   TMR314              __at(0x1FD2E);	// @ (0x3FA5 * 8 + 6)
#define                                 TMR314_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR315>
extern volatile __bit                   TMR315              __at(0x1FD2F);	// @ (0x3FA5 * 8 + 7)
#define                                 TMR315_bit          _BIT_ACCESS(TMR3H,7)
// TMR3L<TMR32>
extern volatile __bit                   TMR32               __at(0x1FD22);	// @ (0x3FA4 * 8 + 2)
#define                                 TMR32_bit           _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR33>
extern volatile __bit                   TMR33               __at(0x1FD23);	// @ (0x3FA4 * 8 + 3)
#define                                 TMR33_bit           _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR34>
extern volatile __bit                   TMR34               __at(0x1FD24);	// @ (0x3FA4 * 8 + 4)
#define                                 TMR34_bit           _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR35>
extern volatile __bit                   TMR35               __at(0x1FD25);	// @ (0x3FA4 * 8 + 5)
#define                                 TMR35_bit           _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR36>
extern volatile __bit                   TMR36               __at(0x1FD26);	// @ (0x3FA4 * 8 + 6)
#define                                 TMR36_bit           _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR37>
extern volatile __bit                   TMR37               __at(0x1FD27);	// @ (0x3FA4 * 8 + 7)
#define                                 TMR37_bit           _BIT_ACCESS(TMR3L,7)
// TMR3H<TMR38>
extern volatile __bit                   TMR38               __at(0x1FD28);	// @ (0x3FA5 * 8 + 0)
#define                                 TMR38_bit           _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR39>
extern volatile __bit                   TMR39               __at(0x1FD29);	// @ (0x3FA5 * 8 + 1)
#define                                 TMR39_bit           _BIT_ACCESS(TMR3H,1)
// PIE6<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x1CCB7);	// @ (0x3996 * 8 + 7)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE6,7)
// PIR6<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x1CD37);	// @ (0x39A6 * 8 + 7)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR6,7)
// IPR6<TMR3GIP>
extern volatile __bit                   TMR3GIP             __at(0x1CC37);	// @ (0x3986 * 8 + 7)
#define                                 TMR3GIP_bit         _BIT_ACCESS(IPR6,7)
// TMR3H<TMR3H0>
extern volatile __bit                   TMR3H0              __at(0x1FD28);	// @ (0x3FA5 * 8 + 0)
#define                                 TMR3H0_bit          _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR3H1>
extern volatile __bit                   TMR3H1              __at(0x1FD29);	// @ (0x3FA5 * 8 + 1)
#define                                 TMR3H1_bit          _BIT_ACCESS(TMR3H,1)
// TMR3H<TMR3H2>
extern volatile __bit                   TMR3H2              __at(0x1FD2A);	// @ (0x3FA5 * 8 + 2)
#define                                 TMR3H2_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR3H3>
extern volatile __bit                   TMR3H3              __at(0x1FD2B);	// @ (0x3FA5 * 8 + 3)
#define                                 TMR3H3_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR3H4>
extern volatile __bit                   TMR3H4              __at(0x1FD2C);	// @ (0x3FA5 * 8 + 4)
#define                                 TMR3H4_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR3H5>
extern volatile __bit                   TMR3H5              __at(0x1FD2D);	// @ (0x3FA5 * 8 + 5)
#define                                 TMR3H5_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR3H6>
extern volatile __bit                   TMR3H6              __at(0x1FD2E);	// @ (0x3FA5 * 8 + 6)
#define                                 TMR3H6_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR3H7>
extern volatile __bit                   TMR3H7              __at(0x1FD2F);	// @ (0x3FA5 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE6<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x1CCB6);	// @ (0x3996 * 8 + 6)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE6,6)
// PIR6<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x1CD36);	// @ (0x39A6 * 8 + 6)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR6,6)
// IPR6<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x1CC36);	// @ (0x3986 * 8 + 6)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR6,6)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x1FD20);	// @ (0x3FA4 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x1FD21);	// @ (0x3FA4 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x1FD22);	// @ (0x3FA4 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x1FD23);	// @ (0x3FA4 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x1FD24);	// @ (0x3FA4 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x1FD25);	// @ (0x3FA4 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x1FD26);	// @ (0x3FA4 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x1FD27);	// @ (0x3FA4 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x1CE0B);	// @ (0x39C1 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x1FD30);	// @ (0x3FA6 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE7<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x1CCB8);	// @ (0x3997 * 8 + 0)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE7,0)
// PIR7<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x1CD38);	// @ (0x39A7 * 8 + 0)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR7,0)
// IPR7<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x1CC38);	// @ (0x3987 * 8 + 0)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR7,0)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x1CE0C);	// @ (0x39C1 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x1FD07);	// @ (0x3FA0 * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// TMR5L<TMR50>
extern volatile __bit                   TMR50               __at(0x1FCC0);	// @ (0x3F98 * 8 + 0)
#define                                 TMR50_bit           _BIT_ACCESS(TMR5L,0)
// TMR5L<TMR51>
extern volatile __bit                   TMR51               __at(0x1FCC1);	// @ (0x3F98 * 8 + 1)
#define                                 TMR51_bit           _BIT_ACCESS(TMR5L,1)
// TMR5H<TMR510>
extern volatile __bit                   TMR510              __at(0x1FCCA);	// @ (0x3F99 * 8 + 2)
#define                                 TMR510_bit          _BIT_ACCESS(TMR5H,2)
// TMR5H<TMR511>
extern volatile __bit                   TMR511              __at(0x1FCCB);	// @ (0x3F99 * 8 + 3)
#define                                 TMR511_bit          _BIT_ACCESS(TMR5H,3)
// TMR5H<TMR512>
extern volatile __bit                   TMR512              __at(0x1FCCC);	// @ (0x3F99 * 8 + 4)
#define                                 TMR512_bit          _BIT_ACCESS(TMR5H,4)
// TMR5H<TMR513>
extern volatile __bit                   TMR513              __at(0x1FCCD);	// @ (0x3F99 * 8 + 5)
#define                                 TMR513_bit          _BIT_ACCESS(TMR5H,5)
// TMR5H<TMR514>
extern volatile __bit                   TMR514              __at(0x1FCCE);	// @ (0x3F99 * 8 + 6)
#define                                 TMR514_bit          _BIT_ACCESS(TMR5H,6)
// TMR5H<TMR515>
extern volatile __bit                   TMR515              __at(0x1FCCF);	// @ (0x3F99 * 8 + 7)
#define                                 TMR515_bit          _BIT_ACCESS(TMR5H,7)
// TMR5L<TMR52>
extern volatile __bit                   TMR52               __at(0x1FCC2);	// @ (0x3F98 * 8 + 2)
#define                                 TMR52_bit           _BIT_ACCESS(TMR5L,2)
// TMR5L<TMR53>
extern volatile __bit                   TMR53               __at(0x1FCC3);	// @ (0x3F98 * 8 + 3)
#define                                 TMR53_bit           _BIT_ACCESS(TMR5L,3)
// TMR5L<TMR54>
extern volatile __bit                   TMR54               __at(0x1FCC4);	// @ (0x3F98 * 8 + 4)
#define                                 TMR54_bit           _BIT_ACCESS(TMR5L,4)
// TMR5L<TMR55>
extern volatile __bit                   TMR55               __at(0x1FCC5);	// @ (0x3F98 * 8 + 5)
#define                                 TMR55_bit           _BIT_ACCESS(TMR5L,5)
// TMR5L<TMR56>
extern volatile __bit                   TMR56               __at(0x1FCC6);	// @ (0x3F98 * 8 + 6)
#define                                 TMR56_bit           _BIT_ACCESS(TMR5L,6)
// TMR5L<TMR57>
extern volatile __bit                   TMR57               __at(0x1FCC7);	// @ (0x3F98 * 8 + 7)
#define                                 TMR57_bit           _BIT_ACCESS(TMR5L,7)
// TMR5H<TMR58>
extern volatile __bit                   TMR58               __at(0x1FCC8);	// @ (0x3F99 * 8 + 0)
#define                                 TMR58_bit           _BIT_ACCESS(TMR5H,0)
// TMR5H<TMR59>
extern volatile __bit                   TMR59               __at(0x1FCC9);	// @ (0x3F99 * 8 + 1)
#define                                 TMR59_bit           _BIT_ACCESS(TMR5H,1)
// PIE8<TMR5GIE>
extern volatile __bit                   TMR5GIE             __at(0x1CCC7);	// @ (0x3998 * 8 + 7)
#define                                 TMR5GIE_bit         _BIT_ACCESS(PIE8,7)
// PIR8<TMR5GIF>
extern volatile __bit                   TMR5GIF             __at(0x1CD47);	// @ (0x39A8 * 8 + 7)
#define                                 TMR5GIF_bit         _BIT_ACCESS(PIR8,7)
// IPR8<TMR5GIP>
extern volatile __bit                   TMR5GIP             __at(0x1CC47);	// @ (0x3988 * 8 + 7)
#define                                 TMR5GIP_bit         _BIT_ACCESS(IPR8,7)
// TMR5H<TMR5H0>
extern volatile __bit                   TMR5H0              __at(0x1FCC8);	// @ (0x3F99 * 8 + 0)
#define                                 TMR5H0_bit          _BIT_ACCESS(TMR5H,0)
// TMR5H<TMR5H1>
extern volatile __bit                   TMR5H1              __at(0x1FCC9);	// @ (0x3F99 * 8 + 1)
#define                                 TMR5H1_bit          _BIT_ACCESS(TMR5H,1)
// TMR5H<TMR5H2>
extern volatile __bit                   TMR5H2              __at(0x1FCCA);	// @ (0x3F99 * 8 + 2)
#define                                 TMR5H2_bit          _BIT_ACCESS(TMR5H,2)
// TMR5H<TMR5H3>
extern volatile __bit                   TMR5H3              __at(0x1FCCB);	// @ (0x3F99 * 8 + 3)
#define                                 TMR5H3_bit          _BIT_ACCESS(TMR5H,3)
// TMR5H<TMR5H4>
extern volatile __bit                   TMR5H4              __at(0x1FCCC);	// @ (0x3F99 * 8 + 4)
#define                                 TMR5H4_bit          _BIT_ACCESS(TMR5H,4)
// TMR5H<TMR5H5>
extern volatile __bit                   TMR5H5              __at(0x1FCCD);	// @ (0x3F99 * 8 + 5)
#define                                 TMR5H5_bit          _BIT_ACCESS(TMR5H,5)
// TMR5H<TMR5H6>
extern volatile __bit                   TMR5H6              __at(0x1FCCE);	// @ (0x3F99 * 8 + 6)
#define                                 TMR5H6_bit          _BIT_ACCESS(TMR5H,6)
// TMR5H<TMR5H7>
extern volatile __bit                   TMR5H7              __at(0x1FCCF);	// @ (0x3F99 * 8 + 7)
#define                                 TMR5H7_bit          _BIT_ACCESS(TMR5H,7)
// PIE8<TMR5IE>
extern volatile __bit                   TMR5IE              __at(0x1CCC6);	// @ (0x3998 * 8 + 6)
#define                                 TMR5IE_bit          _BIT_ACCESS(PIE8,6)
// PIR8<TMR5IF>
extern volatile __bit                   TMR5IF              __at(0x1CD46);	// @ (0x39A8 * 8 + 6)
#define                                 TMR5IF_bit          _BIT_ACCESS(PIR8,6)
// IPR8<TMR5IP>
extern volatile __bit                   TMR5IP              __at(0x1CC46);	// @ (0x3988 * 8 + 6)
#define                                 TMR5IP_bit          _BIT_ACCESS(IPR8,6)
// TMR5L<TMR5L0>
extern volatile __bit                   TMR5L0              __at(0x1FCC0);	// @ (0x3F98 * 8 + 0)
#define                                 TMR5L0_bit          _BIT_ACCESS(TMR5L,0)
// TMR5L<TMR5L1>
extern volatile __bit                   TMR5L1              __at(0x1FCC1);	// @ (0x3F98 * 8 + 1)
#define                                 TMR5L1_bit          _BIT_ACCESS(TMR5L,1)
// TMR5L<TMR5L2>
extern volatile __bit                   TMR5L2              __at(0x1FCC2);	// @ (0x3F98 * 8 + 2)
#define                                 TMR5L2_bit          _BIT_ACCESS(TMR5L,2)
// TMR5L<TMR5L3>
extern volatile __bit                   TMR5L3              __at(0x1FCC3);	// @ (0x3F98 * 8 + 3)
#define                                 TMR5L3_bit          _BIT_ACCESS(TMR5L,3)
// TMR5L<TMR5L4>
extern volatile __bit                   TMR5L4              __at(0x1FCC4);	// @ (0x3F98 * 8 + 4)
#define                                 TMR5L4_bit          _BIT_ACCESS(TMR5L,4)
// TMR5L<TMR5L5>
extern volatile __bit                   TMR5L5              __at(0x1FCC5);	// @ (0x3F98 * 8 + 5)
#define                                 TMR5L5_bit          _BIT_ACCESS(TMR5L,5)
// TMR5L<TMR5L6>
extern volatile __bit                   TMR5L6              __at(0x1FCC6);	// @ (0x3F98 * 8 + 6)
#define                                 TMR5L6_bit          _BIT_ACCESS(TMR5L,6)
// TMR5L<TMR5L7>
extern volatile __bit                   TMR5L7              __at(0x1FCC7);	// @ (0x3F98 * 8 + 7)
#define                                 TMR5L7_bit          _BIT_ACCESS(TMR5L,7)
// PMD1<TMR5MD>
extern volatile __bit                   TMR5MD              __at(0x1CE0D);	// @ (0x39C1 * 8 + 5)
#define                                 TMR5MD_bit          _BIT_ACCESS(PMD1,5)
// T5CON<TMR5ON>
